; domain
; remove negative-precondition for powerlifted
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
    (:requirements :typing :strips)
    ; (:requirements :typing :strips :negative-preconditions)
    (:types
        car - object
        location - object
    )

    (:predicates
        (at-ferry ?l - location)
        (at ?c - car ?l - location)
        (empty-ferry)
        (on ?c - car)
    )

    (:action sail
        :parameters (?from - location ?to - location)
        :precondition (and
            (at-ferry ?from)
            ; (not (at-ferry ?to))
        )
        :effect (and (at-ferry ?to) (not (at-ferry ?from)))
    )

    (:action board
        :parameters (?car - car ?loc - location)
        :precondition (and (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
        :effect (and
            (on ?car)
            (not (at ?car ?loc))
            (not (empty-ferry)))
    )

    (:action debark
        :parameters (?car - car ?loc - location)
        :precondition (and (on ?car) (at-ferry ?loc))
        :effect (and
            (at ?car ?loc)
            (empty-ferry)
            (not (on ?car)))
    )
)

; problem
;; cars=18, locations=14, out_folder=training/easy, instance_id=89, seed=119

(define (problem ferry-89)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 car11 car12 car13 car14 car15 car16 car17 car18 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 loc11 loc12 loc13 loc14 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc5)
    (at car1 loc3)
    (at car2 loc12)
    (at car3 loc13)
    (at car4 loc9)
    (at car5 loc11)
    (at car6 loc13)
    (at car7 loc9)
    (at car8 loc13)
    (at car9 loc7)
    (at car10 loc2)
    (at car11 loc2)
    (at car12 loc7)
    (at car13 loc11)
    (at car14 loc4)
    (at car15 loc3)
    (at car16 loc5)
    (at car17 loc13)
    (at car18 loc5)
)
 (:goal  (and (at car1 loc5)
   (at car2 loc8)
   (at car3 loc10)
   (at car4 loc1)
   (at car5 loc7)
   (at car6 loc12)
   (at car7 loc5)
   (at car8 loc7)
   (at car9 loc13)
   (at car10 loc13)
   (at car11 loc1)
   (at car12 loc12)
   (at car13 loc12)
   (at car14 loc7)
   (at car15 loc5)
   (at car16 loc3)
   (at car17 loc8)
   (at car18 loc1))))

; plan
1. (sail loc5 loc3)
   deleted: (at-ferry loc5)
   added: (at-ferry loc3)
   goals met: 0 of 18
2. (board car1 loc3)
   deleted: (at car1 loc3) (empty-ferry)
   added: (on car1)
   goals met: 0 of 18
3. (sail loc3 loc5)
   deleted: (at-ferry loc3)
   added: (at-ferry loc5)
   goals met: 0 of 18
4. (debark car1 loc5)
   deleted: (on car1)
   added: (at car1 loc5) (empty-ferry)
   goals met: 1 of 18
5. (sail loc5 loc12)
   deleted: (at-ferry loc5)
   added: (at-ferry loc12)
   goals met: 1 of 18
6. (board car2 loc12)
   deleted: (at car2 loc12) (empty-ferry)
   added: (on car2)
   goals met: 1 of 18
7. (sail loc12 loc8)
   deleted: (at-ferry loc12)
   added: (at-ferry loc8)
   goals met: 1 of 18
8. (debark car2 loc8)
   deleted: (on car2)
   added: (at car2 loc8) (empty-ferry)
   goals met: 2 of 18
9. (sail loc8 loc13)
   deleted: (at-ferry loc8)
   added: (at-ferry loc13)
   goals met: 2 of 18
10. (board car3 loc13)
   deleted: (at car3 loc13) (empty-ferry)
   added: (on car3)
   goals met: 2 of 18
11. (sail loc13 loc10)
   deleted: (at-ferry loc13)
   added: (at-ferry loc10)
   goals met: 2 of 18
12. (debark car3 loc10)
   deleted: (on car3)
   added: (at car3 loc10) (empty-ferry)
   goals met: 3 of 18
13. (sail loc10 loc9)
   deleted: (at-ferry loc10)
   added: (at-ferry loc9)
   goals met: 3 of 18
14. (board car4 loc9)
   deleted: (at car4 loc9) (empty-ferry)
   added: (on car4)
   goals met: 3 of 18
15. (sail loc9 loc1)
   deleted: (at-ferry loc9)
   added: (at-ferry loc1)
   goals met: 3 of 18
16. (debark car4 loc1)
   deleted: (on car4)
   added: (at car4 loc1) (empty-ferry)
   goals met: 4 of 18
17. (sail loc1 loc11)
   deleted: (at-ferry loc1)
   added: (at-ferry loc11)
   goals met: 4 of 18
18. (board car5 loc11)
   deleted: (at car5 loc11) (empty-ferry)
   added: (on car5)
   goals met: 4 of 18
19. (sail loc11 loc7)
   deleted: (at-ferry loc11)
   added: (at-ferry loc7)
   goals met: 4 of 18
20. (debark car5 loc7)
   deleted: (on car5)
   added: (at car5 loc7) (empty-ferry)
   goals met: 5 of 18
21. (sail loc7 loc13)
   deleted: (at-ferry loc7)
   added: (at-ferry loc13)
   goals met: 5 of 18
22. (board car6 loc13)
   deleted: (at car6 loc13) (empty-ferry)
   added: (on car6)
   goals met: 5 of 18
23. (sail loc13 loc12)
   deleted: (at-ferry loc13)
   added: (at-ferry loc12)
   goals met: 5 of 18
24. (debark car6 loc12)
   deleted: (on car6)
   added: (at car6 loc12) (empty-ferry)
   goals met: 6 of 18
25. (sail loc12 loc9)
   deleted: (at-ferry loc12)
   added: (at-ferry loc9)
   goals met: 6 of 18
26. (board car7 loc9)
   deleted: (at car7 loc9) (empty-ferry)
   added: (on car7)
   goals met: 6 of 18
27. (sail loc9 loc5)
   deleted: (at-ferry loc9)
   added: (at-ferry loc5)
   goals met: 6 of 18
28. (debark car7 loc5)
   deleted: (on car7)
   added: (at car7 loc5) (empty-ferry)
   goals met: 7 of 18
29. (sail loc5 loc13)
   deleted: (at-ferry loc5)
   added: (at-ferry loc13)
   goals met: 7 of 18
30. (board car8 loc13)
   deleted: (at car8 loc13) (empty-ferry)
   added: (on car8)
   goals met: 7 of 18
31. (sail loc13 loc7)
   deleted: (at-ferry loc13)
   added: (at-ferry loc7)
   goals met: 7 of 18
32. (debark car8 loc7)
   deleted: (on car8)
   added: (at car8 loc7) (empty-ferry)
   goals met: 8 of 18
33. (board car9 loc7)
   deleted: (at car9 loc7) (empty-ferry)
   added: (on car9)
   goals met: 8 of 18
34. (sail loc7 loc13)
   deleted: (at-ferry loc7)
   added: (at-ferry loc13)
   goals met: 8 of 18
35. (debark car9 loc13)
   deleted: (on car9)
   added: (at car9 loc13) (empty-ferry)
   goals met: 9 of 18
36. (sail loc13 loc2)
   deleted: (at-ferry loc13)
   added: (at-ferry loc2)
   goals met: 9 of 18
37. (board car10 loc2)
   deleted: (at car10 loc2) (empty-ferry)
   added: (on car10)
   goals met: 9 of 18
38. (sail loc2 loc13)
   deleted: (at-ferry loc2)
   added: (at-ferry loc13)
   goals met: 9 of 18
39. (debark car10 loc13)
   deleted: (on car10)
   added: (at car10 loc13) (empty-ferry)
   goals met: 10 of 18
40. (sail loc13 loc2)
   deleted: (at-ferry loc13)
   added: (at-ferry loc2)
   goals met: 10 of 18
41. (board car11 loc2)
   deleted: (at car11 loc2) (empty-ferry)
   added: (on car11)
   goals met: 10 of 18
42. (sail loc2 loc1)
   deleted: (at-ferry loc2)
   added: (at-ferry loc1)
   goals met: 10 of 18
43. (debark car11 loc1)
   deleted: (on car11)
   added: (at car11 loc1) (empty-ferry)
   goals met: 11 of 18
44. (sail loc1 loc7)
   deleted: (at-ferry loc1)
   added: (at-ferry loc7)
   goals met: 11 of 18
45. (board car12 loc7)
   deleted: (at car12 loc7) (empty-ferry)
   added: (on car12)
   goals met: 11 of 18
46. (sail loc7 loc12)
   deleted: (at-ferry loc7)
   added: (at-ferry loc12)
   goals met: 11 of 18
47. (debark car12 loc12)
   deleted: (on car12)
   added: (at car12 loc12) (empty-ferry)
   goals met: 12 of 18
48. (sail loc12 loc11)
   deleted: (at-ferry loc12)
   added: (at-ferry loc11)
   goals met: 12 of 18
49. (board car13 loc11)
   deleted: (at car13 loc11) (empty-ferry)
   added: (on car13)
   goals met: 12 of 18
50. (sail loc11 loc12)
   deleted: (at-ferry loc11)
   added: (at-ferry loc12)
   goals met: 12 of 18
51. (debark car13 loc12)
   deleted: (on car13)
   added: (at car13 loc12) (empty-ferry)
   goals met: 13 of 18
52. (sail loc12 loc4)
   deleted: (at-ferry loc12)
   added: (at-ferry loc4)
   goals met: 13 of 18
53. (board car14 loc4)
   deleted: (at car14 loc4) (empty-ferry)
   added: (on car14)
   goals met: 13 of 18
54. (sail loc4 loc7)
   deleted: (at-ferry loc4)
   added: (at-ferry loc7)
   goals met: 13 of 18
55. (debark car14 loc7)
   deleted: (on car14)
   added: (at car14 loc7) (empty-ferry)
   goals met: 14 of 18
56. (sail loc7 loc3)
   deleted: (at-ferry loc7)
   added: (at-ferry loc3)
   goals met: 14 of 18
57. (board car15 loc3)
   deleted: (at car15 loc3) (empty-ferry)
   added: (on car15)
   goals met: 14 of 18
58. (sail loc3 loc5)
   deleted: (at-ferry loc3)
   added: (at-ferry loc5)
   goals met: 14 of 18
59. (debark car15 loc5)
   deleted: (on car15)
   added: (at car15 loc5) (empty-ferry)
   goals met: 15 of 18
60. (board car16 loc5)
   deleted: (at car16 loc5) (empty-ferry)
   added: (on car16)
   goals met: 15 of 18
61. (sail loc5 loc3)
   deleted: (at-ferry loc5)
   added: (at-ferry loc3)
   goals met: 15 of 18
62. (debark car16 loc3)
   deleted: (on car16)
   added: (at car16 loc3) (empty-ferry)
   goals met: 16 of 18
63. (sail loc3 loc13)
   deleted: (at-ferry loc3)
   added: (at-ferry loc13)
   goals met: 16 of 18
64. (board car17 loc13)
   deleted: (at car17 loc13) (empty-ferry)
   added: (on car17)
   goals met: 16 of 18
65. (sail loc13 loc8)
   deleted: (at-ferry loc13)
   added: (at-ferry loc8)
   goals met: 16 of 18
66. (debark car17 loc8)
   deleted: (on car17)
   added: (at car17 loc8) (empty-ferry)
   goals met: 17 of 18
67. (sail loc8 loc5)
   deleted: (at-ferry loc8)
   added: (at-ferry loc5)
   goals met: 17 of 18
68. (board car18 loc5)
   deleted: (at car18 loc5) (empty-ferry)
   added: (on car18)
   goals met: 17 of 18
69. (sail loc5 loc1)
   deleted: (at-ferry loc5)
   added: (at-ferry loc1)
   goals met: 17 of 18
70. (debark car18 loc1)
   deleted: (on car18)
   added: (at car18 loc1) (empty-ferry)
   goals met: 18 of 18
